Revit 2027 API
ParameterTypeId.TrussFamilyVertWebStructuralTypesParam Property
 "Structural Framing Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TrussFamilyVertWebStructuralTypesParam { get; }
Public Shared ReadOnly Property TrussFamilyVertWebStructuralTypesParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TrussFamilyVertWebStructuralTypesParam {
	ForgeTypeId^ get ();
}
static member TrussFamilyVertWebStructuralTypesParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace